In [21]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import StandardScaler

In [2]:
shopping_df = pd.read_csv('shopping_data.csv')
shopping_df.head()

   CustomerID Card Member   Age  Annual Income  Spending Score (1-100)
0           1         Yes  19.0          15000                    39.0
1           2         Yes  21.0          15000                    81.0
2           3          No  20.0          16000                     6.0
3           4          No  23.0          16000                    77.0
4           5          No  31.0          17000                    40.0

In [4]:
shopping_df.describe()

       CustomerID         Age  Annual Income  Spending Score (1-100)
count  203.000000  201.000000     203.000000              202.000000
mean   102.000000   38.766169   60339.901478               49.975248
std     58.745213   13.984636   26377.453131               25.845780
min      1.000000   18.000000   15000.000000                1.000000
25%     51.500000   28.000000   40000.000000               34.250000
50%    102.000000   36.000000   61000.000000               50.000000
75%    152.500000   49.000000   78000.000000               72.750000
max    203.000000   70.000000  137000.000000               99.000000

In [5]:
shopping_df.isnull().sum()

CustomerID                0
Card Member               2
Age                       2
Annual Income             0
Spending Score (1-100)    1
dtype: int64

In [6]:
shopping_df = shopping_df.dropna()

In [7]:
shopping_df.isnull().sum()

CustomerID                0
Card Member               0
Age                       0
Annual Income             0
Spending Score (1-100)    0
dtype: int64

In [8]:
shopping_df.dtypes

CustomerID                  int64
Card Member                object
Age                       float64
Annual Income               int64
Spending Score (1-100)    float64
dtype: object

In [10]:
shopping_df.duplicated().sum()

0

In [12]:
shopping_df = shopping_df.drop(columns = 'CustomerID')
shopping_df.head()

  Card Member   Age  Annual Income  Spending Score (1-100)
0         Yes  19.0          15000                    39.0
1         Yes  21.0          15000                    81.0
2          No  20.0          16000                     6.0
3          No  23.0          16000                    77.0
4          No  31.0          17000                    40.0

In [14]:
def change_string(member):
    if member == 'Yes':
        return 1
    else:
        return 0

In [15]:
shopping_df['Card Member'] = shopping_df['Card Member'].apply(change_string)

In [16]:
shopping_df.head()

   Card Member   Age  Annual Income  Spending Score (1-100)
0            1  19.0          15000                    39.0
1            1  21.0          15000                    81.0
2            0  20.0          16000                     6.0
3            0  23.0          16000                    77.0
4            0  31.0          17000                    40.0

In [22]:
scaler = StandardScaler()
scaled_data = scaler.fit_transform(shopping_df)

In [24]:
scaled_shopper_df = pd.DataFrame(scaled_data, columns = shopping_df.columns)

In [27]:
scaled_shopper_df.rename(columns = {'Card Member':  'card_member',
                          'Annual Income':  'annual_income',
                          'Spending Score (1-100)':  'spending_score'},inplace = True)

In [28]:
scaled_shopper_df.head()

   card_member       Age  annual_income  spending_score
0     1.128152 -1.424569      -1.738999       -0.434801
1     1.128152 -1.281035      -1.738999        1.195704
2    -0.886405 -1.352802      -1.700830       -1.715913
3    -0.886405 -1.137502      -1.700830        1.040418
4    -0.886405 -0.563369      -1.662660       -0.395980

In [29]:
scaled_shopper_df.to_csv('shopper_data_scaled_with_StandardScaler.csv', index=False)